<?php
$id = 3457;
$secret = config('app.key');
$token = md5($id . $secret . 'telegram-notify');
$url = route('photo-report.download.public', ['requestId' => $id, 'token' => $token]);

$msg = "✅ <b>Заявка #3457 закрыта (Демонтаж МЭШ)</b>

🏢 <b>Организация:</b> ГБОУ Школа имени В.В. Маяковского
📍 <b>Адрес:</b> Южнопортовый 1-я Дубровская 16
👥 <b>Бригада:</b>
- Парамонов Станислав Сергеевич (бригадир)

🛠 <b>Выполненные работы:</b>
- Точка доступа: 47
- Маршрутизатор: 1
- Сервер: 1
- ИБП: 1
- ИП: 17
- Коммутатор: 4

📝 <b>Комментарий:</b>
ИП-17, ТД-41, Ком-4, М.С.И. по 1 штуке, 1 кросс шкаф(1 этаж, 25 по БТИ), 2 трансивера Хуавей.

🔗 <a href='$url'>Скачать фото и файлы по заявке #3457</a>";

$process = proc_open('/var/www/lan-install/utils/C/notify-bot/telegram_notify', [['pipe', 'r'], ['file', '/dev/null', 'w'], ['file', '/dev/null', 'w']], $pipes);
if (is_resource($process)) {
    fwrite($pipes[0], $msg);
    fclose($pipes[0]);
    proc_close($process);
    echo 'Notification sent successfully.';
}

